name: "SSD_400x300_test"
layer {
  name: "data"
  type: "AnnotatedData"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mean_value: 128
    mean_value: 128
    mean_value: 128
    resize_param {
      prob: 1
      resize_mode: WARP
      height: 300
      width: 400
      interp_mode: LINEAR
    }
  }
  data_param {
    source: "/home/libailing/data/VOCdevkit/fujian_QuanZhou_ctpt/lmdb/fujian_QuanZhou_ctpt_test_lmdb"
    batch_size: 8
    backend: LMDB
  }
  annotated_data_param {
    batch_sampler {
    }
    label_map_file: "/home/libailing/data/labelmap_voc.prototxt"
  }
}
