name: "test_segment_data_layer"
layer {
  name: "data"
  type: "SegmentedData"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    mean_value: 128
    mean_value: 128
    mean_value: 128
    resize_param {
      prob: 1
      resize_mode: WARP
      height: 300
      width: 400
      interp_mode: LINEAR
      interp_mode: AREA
      interp_mode: NEAREST
      interp_mode: CUBIC
      interp_mode: LANCZOS4
    }
    emit_constraint {
      emit_type: CENTER
    }

  }
  data_param {
    source: "/home/libailing/data/SegmentData/people_test/lmdb/trainval_db"
    batch_size: 8
    backend: LMDB
  }  
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 1
    pad: 1
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

